/* 
Задания JDBC Программирование баз данных в Java
В каждом из заданий необходимо выполнить следующие действия:
• Организацию соединения с базой данных вынести в отдельный класс, метод которого возвращает соединение.
• Создать БД. Привести таблицы к одной из нормированных форм.
• Создать класс для выполнения запросов на извлечение информации из БД с использованием компилированных запросов.
• Создать класс на добавление информации.
• Результаты выполнения запроса вывести в консоль.

Словарь. 
В БД хранится англо-русский словарь, в котором для одного английского слова может быть указано несколько его значений и наоборот. 
Со стороны клиента вводятся последовательно английские (русские) слова. 
Для каждого из них вывести на консоль все русские (английские) значения слова.
 */
public class Main 
{
	public static void main(String[] args) 
	{
	}
}
