<ol class="breadcrumb">
  <li><a href="/">главная</a></li>
  <li class="active">панель администрирования</li>
</ol>
<p>
Админка...
<!--
Пока что, отобразим здесь простой текст.
Далее можно добавить в админку некоторый функционал.
Например, WYSIWYG-редактор для изменения страниц сайта (видов).
Тогда, этот вид будет содержать выпадающий список для выбора страницы, поле редактора, а также кнопку
для сохранения изменений. А некоторое действие контроллера администрирования будет описывать логику редактирования страниц.
-->
</p>
