<ol class="breadcrumb">
  <li class="active">главная</li>
</ol>
<div class="container-fluid">
  <div class="row-fluid">
    <div class="col-sm-* col-xs-*">
      <p class="lead">Добро пожаловать!</p>
      <p>Вашему вниманию представлена наша пробная совместная разработка.</p>
      <p>Она включает себя следующий функционал:
        <ul> 
          <li>ведение справочников для учёта и управления (функционалом, персоналом, доступом, связями, продукцией);</li>
          <li>автоматизация логистических процессов;</li>
          <li>протоколирование гарантийных и постгарантийных случаев;</li>
          <li>формирование отчётов.</li>
        </ul>
      </p>
      <p>P.S.: Надеемся, Вы останетесь довольны.</p>
      <pre class="bg-info<?php echo (isset($_SESSION, $_SESSION['logged']) and $_SESSION['logged'] === 1) ? " hidden" : "";?>">Для доступа к перечисленному функционалу необходимо <a href="/profile/logon">войти</a> в свой профиль.</pre>
    </div>
  </div>
</div>